# -----------------------------
# تنظیمات اصلی ربات
# -----------------------------

# توکن ربات از BotFather
BOT_TOKEN = "8811322864:AAFa7SiqM2W4Gs1miQJNCvF12VsDprNhw0w"

# -----------------------------
# تنظیمات پروکسی تلگرام
# -----------------------------
# خروجی SOCKS5 فیلترشکن (مثل v2rayN) روی پورت 10808

TELEGRAM_PROXY = "socks5://127.0.0.1:10808"


# -----------------------------
# تنظیمات مالک ربات
# -----------------------------
# اگر آیدی عددی خودت رو می‌دونی، اینجا بذار؛ فعلاً خالی می‌ذاریم.

OWNER_ID = None

# -----------------------------
# تنظیمات دیتابیس
# -----------------------------

DATABASE_PATH = "database.db"
